{"info": "Samar Sajnani • Phone: (226) 700-6041 • Email: samar.sajnani@live.com • Website: ssajnani.github.io • GitHub: ssajnani","Experience":[{"position": "IBM Watson Data Platform Private Cloud Intern", "date": "May. 2017 – Aug.2018", "bullets": "• Approximately 1300+ contributions on IBM’s enterprise GitHub • Won an award for DSX poster presentation and a CrushIT award for the ICP4D Installer • Lead developer in the ICP4D installer, a new product that made $12 million in 6 months • Led the effort to create JDBC and HDFS functions used to obtain dataframes in Python, R, and Scala • Optimized CI/CD time by 50%+: created an automated framework for provisioning, installing and testing"}, {"position": "Computer Science Teaching Assistant (First-Year Web Development Course)", "date": "Jan. – Apr. 2019", "bullets": "• Motivated students by providing topical links to new technologies and their uses in computer science • Responsible for marking approximately 50 students assignments and providing feedback"}, {"position": "Health-related Twitter Data Mining", "date": "Oct. 2016 – Apr. 2017", "bullets": "• Mined spreadsheets of health-related tweets and classified the data according to health-related topics • Labelled thousands of tweets based on health-related conditions and their sentiments, increasing model accuracy from 65% to 82%"}], "Research":[{"topic": "Empirical Study of a Policy and POJO-based Reconfiguration System for the Cloud", "date": "Sept. 2018 – Apr. 2019", "bullets": "• Utilized the Kubernetes Java API as a metamodel to generate a POJO-based model of the cluster • Modified the Kubernetes source code to implement custom policies that can trigger reconfiguration actions"},{"topic": "Optimization of a Fluorescence-Based Cancer Biosensor (Biochemistry Thesis)", "date": "May. – Aug. 2014", "bullets": "• Dr. David Litchfield, the chair of the Biochemistry Department, directed the research project • Majority of the work was cloning, protein extraction, and fluorescence microscopy"}],"Skills": [{"type": "Cloud Computing", "description": "Knowledge of the inner workings of Kubernetes, Docker, Ansible and GlusterFS"}, {"type": "Linux", "description": "In-depth analysis of repositories, research on disk usage, logging, scripting, and creating installer executables"}, {"type": "Application Development", "description": "Many of my projects are web, desktop or mobile applications written using JavaScript"}, {"type":"Innovation", "description": "3D Hologram Snake – Created a game using the peppers’ ghost illusion (Harvard University)"}],"Projects": [{"name": "FaStack Mobile and Desktop Application", "date": "Mar. 2018 – Present", "bullets": "• Daily stack that allows users to context switch and prioritize daily tasks • Using React Native to create the mobile application and Electron for the desktop application"}, {"name": "Life Vector Time-Management Mobile Application (Western University)", "date": "Nov. 2016 – Present", "bullets": "• An application that takes location data and computes vectors based on a persons’ home location"}],"Education": [{"degree": "Bachelors of Science", "module": "Honours Specialization in Computer Science", "school": "Western University", "graduation": "2019", "gpa": "3.95/4"}, {"degree": "Bachelors of Medical Sciences", "module": "Honours Specialization in Biochemistry", "school": "Western University", "graduation": "2016", "gpa": "3.6"}],"Advanced Courses": "AI II, Internet Algorithmics, Advanced Methods for Biochemistry"}   
